/*
The MIT License (MIT)

Copyright (c) 2024 sigma-axis

Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the “Software”), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#include <cstdint>
#include <algorithm>
#include <bit>
#include <concepts>
#include <memory>

#define NOMINMAX
#define WIN32_LEAN_AND_MEAN
#include <Windows.h>

using byte = uint8_t;
#include <exedit.hpp>

#include "memory_protect.hpp"
#include "color_abgr.hpp"
using Color = sigma_lib::W32::GDI::Color;

#include "image_loader.hpp"
using image_loader = sigma_lib::W32::GDI::plus::image_loader;


////////////////////////////////
// 算術補助．
////////////////////////////////
namespace arith
{
	// division that rounds toward negative infinity.
	// `divisor` is assumed to be positive.
	template<std::signed_integral NumT>
	static constexpr auto floor_div(NumT dividend, NumT divisor) {
		if (dividend < 0) dividend -= divisor - 1;
		return dividend / divisor;
	}

	// calculates non-negative remainder.
	// `divisor` is assumed to be positive.
	template<std::signed_integral NumT>
	static constexpr auto normal_rem(NumT dividend, NumT divisor) {
		auto rem = dividend % divisor;
		if (rem < 0) rem += divisor;
		return rem;
	}
}


////////////////////////////////
// 主要情報源の変数アドレス．
////////////////////////////////
inline constinit struct ExEdit092 {
	AviUtl::FilterPlugin* fp;
	constexpr static auto info_exedit092 = "拡張編集(exedit) version 0.92 by ＫＥＮくん";
	bool init(AviUtl::FilterPlugin* this_fp)
	{
		if (fp != nullptr) return true;
		AviUtl::SysInfo si; this_fp->exfunc->get_sys_info(nullptr, &si);
		for (int i = 0; i < si.filter_n; i++) {
			auto that_fp = this_fp->exfunc->get_filterp(i);
			if (that_fp->information != nullptr &&
				0 == std::strcmp(that_fp->information, info_exedit092)) {
				fp = that_fp;
				init_pointers();
				return true;
			}
		}
		return false;
	}

	int32_t*	SettingDialogObjectIndex;	// 0x177a10
	ExEdit::Object**	ObjectArray_ptr;	// 0x1e0fa4
	int32_t*	NextObjectIdxArray;			// 0x1592d8

	int32_t*	timeline_h_scroll_pos;		// 0x1a52f0
	int32_t*	timeline_v_scroll_pos;		// 0x1a5308

	int32_t*	curr_timeline_scale_len;	// 0x0a3fc8
	int32_t*	curr_timeline_layer_height;	// 0x0a3e20

	int32_t*	timeline_width;				// 0x1a52fc
	int32_t*	timeline_height;			// 0x1a5300

	// font for the display text of each object.
	HFONT**		load_title_font;			// 0x037240 + 2
	byte*		call_select_obj_font;		// 0x037248

	// Ref: 蛇色様の Common-Library より当該関数のアドレス．
	// https://github.com/hebiiro/Common-Library/blob/62e8d04319ab6934d6aec6028f95a8ae69a05355/Common/AviUtlInternal.h#L103
	// m_DrawObject = (Type_DrawObject)(m_exedit + 0x00037060);
	void (*draw_object)(HDC, int32_t);		// 0x037060
	// callers of void draw_object(HDC, int32_t)
	byte*		call_draw_object[4];		// 0x037b53, 0x0393b6, 0x03945b, 0x039505

	// callers of void fill_grad(HDC dc, RECT const* rc, int32_t r1, int32_t g1, int32_t b1, int32_t r2, int32_t g2, int32_t b2, int32_t g_begin, int32_t g_end)
	// Ref: patch.aul のグラデーション描画関数のフック元．
	// https://github.com/nazonoSAUNA/patch.aul/blob/3675923d24ca9a62369dde08fb99ba92dfa97dfe/patch/patch_fast_exeditwindow.hpp#L65-L67
	byte*		call_fill_grad[3];		// 0x0374fa, 0x037562, 0x0375ba

	// Ref: patch.aul の選択中オブジェクトの点線の色を変える機能．
	// https://github.com/nazonoSAUNA/patch.aul/blob/9f7aa96871b29556e228a847356be9ee53acde4e/patch/patch_theme_cc.hpp#L461
	// OverWriteOnProtectHelper(GLOBAL::exedit_base + 0x375fb, 4).store_i32(0, &disp_dialog_pen);
	HPEN**		SelectedObjectBorderPen;	// 0x0375fb

	// Ref: 蛇色様の OptimizeEditBox.auf より，当該関数，変数のアドレス．
	// https://github.com/hebiiro/AviUtl-Plugin-OptimizeEditBox/blob/56d6a5def3502f0f1bcb7b4f874dc1027adca89f/OptimizeEditBox/OptimizeEditBox.cpp#L60-L68
	byte*		DrawLayerBorderL;			// 0x038845
	byte*		DrawLayerBorderT;			// 0x038871
	byte*		DrawLayerBorderR;			// 0x0388aa
	byte*		DrawLayerBorderB;			// 0x0388da
	byte*		DrawLayerBorderSp;			// 0x037a1f

	Color**		color_time_sel_tip;			// 0x038076
	Color**		color_time_sel_int;			// 0x03807e
	Color**		color_time_sel_ext;			// 0x038087

private:
	void init_pointers()
	{
		auto pick_addr = [exedit_base = reinterpret_cast<uintptr_t>(fp->dll_hinst)]
			<class T>(T& target, ptrdiff_t offset) { target = reinterpret_cast<T>(exedit_base + offset); };
		pick_addr(SettingDialogObjectIndex,	0x177a10);
		pick_addr(ObjectArray_ptr,			0x1e0fa4);
		pick_addr(NextObjectIdxArray,		0x1592d8);

		pick_addr(timeline_h_scroll_pos,	0x1a52f0);
		pick_addr(timeline_v_scroll_pos,	0x1a5308);

		pick_addr(curr_timeline_scale_len,	0x0a3fc8);
		pick_addr(curr_timeline_layer_height,	0x0a3e20);

		pick_addr(timeline_width,			0x1a52fc);
		pick_addr(timeline_height,			0x1a5300);

		pick_addr(load_title_font,			0x037240 + 2);
		pick_addr(call_select_obj_font,		0x037248);

		pick_addr(draw_object,				0x037060);
		pick_addr(call_draw_object[0],		0x037b53);
		pick_addr(call_draw_object[1],		0x0393b6);
		pick_addr(call_draw_object[2],		0x03945b);
		pick_addr(call_draw_object[3],		0x039505);

